/*────────────────────────────────────────────────────────────────────────────────────────────────*/

Object.defineProperties(global,{__:{set:v=>process.exit(_=v)},_:{set:console.log}});
Object.defineProperty(global, '$', {value:{}});
console.clear();

/*┌───────────────────────────────────────────────────────┐
  │ Импортируем инициализатор движков и логических единиц │
  └───────────────────────────────────────────────────────┘*/
const Init = require('../init')({
    engines: (engine) => ['engines', engine, `${engine}-engine`], // Путь к движку
});

/*▄──────────────────────────▄
  █                          █
  █  Создает новый протокол  █
  █                          █
  ▀──────────────────────────▀*/
class Protocol {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor() {
    // Инициализируем список движков
        Init.engines(this, [
            'flow', // Движок обработки потока
        ]);
        this.getPackets()
    }
}

// Создаем новый протокол
_=new Protocol();
