/*▄────────────────────────────────▄
  █                                █
  █  Добавляет опции по умолчанию  █
  █                                █
  ▀────────────────────────────────▀*/
module.exports = class {
/*┌────────────────────┐
  │ Опции по умолчанию │
  └────────────────────┘*/
    static defaultOptions = {}
    
/*┌─────────────┐ 
  │ Конструктор │
  └─────────────┘*/
    constructor(options = {}) {
    // Сохраняем опции с учетом значений по умолчанию
        this.options = { ...this.constructor.defaultOptions, ...options };
    }
};
