/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
class Engine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(protocol) {
    // Сохраняем ссылку на основной протокол
        this.protocol = protocol;
    }
}

/*▄─────────────────────────────────────────────▄
  █                                             █
  █  Создает логику обработки входящих пакетов  █
  █                                             █
  ▀─────────────────────────────────────────────▀*/
module.exports = class IncomingFlow extends Engine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(protocol) {
    // Сохраняем ссылку на основной протокол
        super(protocol);
        
        this.id = 2;
    }
    
/*┌─────┐
  │ 123 │
  └─────┘*/
    getId = () => {
        _=`this.protocol.get2(): ${this.protocol.get2()}`
        _=`this.id: ${this.id}`
    }
};
