/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
class Engine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(protocol) {
    // Сохраняем ссылку на основной протокол
        this.protocol = protocol;
    }
}

/*▄──────────────────────────────────────────────▄
  █                                              █
  █  Создает логику обработки исходящих пакетов  █
  █                                              █
  ▀──────────────────────────────────────────────▀*/
module.exports = class OutgoingFlow extends Engine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(protocol) {
    // Сохраняем ссылку на основной протокол
        super(protocol);
        
        this.id = 456;
    }
    
/*┌─────┐
  │ 123 │
  └─────┘*/
    getName = () => {
        return this.id;
    }
};
