/*▄─────────────────────────────────────────────────────────▄
  █                                                         █
  █  Импортируем инициализатор движков и логических единиц  █
  █                                                         █
  ▀─────────────────────────────────────────────────────────▀*/
const Init = require('../../../init')({
    units: (engine, unit) => ['engines', engine, 'logic', unit], // Путь к логической единице
});

/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
class Engine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(protocol) {
    // Сохраняем ссылку на основной протокол
        this.protocol = protocol;
        
    // Сохраняем инициализатор движков и логических единиц
        this.init = Init;
    }
}

/*▄───────────────────────────────────▄
  █                                   █
  █  Создает движок обработки потока  █
  █                                   █
  ▀───────────────────────────────────▀*/
module.exports = class FlowEngine extends Engine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(protocol) {
    // Сохраняем ссылку на основной протокол
        super(protocol);
        
        this.id = 1;
        
    // Инициализируем список логических единиц
        this.init.units(this, [
            'incoming', // Логика обработки входящих пакетов
            'outgoing', // Логика обработки исходящих пакетов
        ]);
        
        setTimeout(() => {
            // __=this.protocol.units
        }, 0);
    }
    
/*┌─────┐
  │ 123 │
  └─────┘*/
    getPackets = () => {
        this.incomingFlow.getId()
        _=`this.id: ${this.id}`
    }
    
/*┌─────┐
  │ 123 │
  └─────┘*/
    get2 = () => {
        _=`this.protocol.get3(): ${this.protocol.get3()}`
        return `this.id: ${this.id}`;
    }
    
/*┌─────┐
  │ 123 │
  └─────┘*/
    get3 = () => {
        return `this.id: ${this.id}`;
    }
};
